// time.c
// 演示延时
// by xcr
// 2026-4-8


#include "common.h"
#include "seg7_mpx8.h"

//===========宏定义===============
#define ON          0x00   
#define OFF         0xFF

#define KEY_ON  0
#define KEY_OFF 1

//======sfr bit定义==============
sbit KEY1=P3^0;
sbit KEY2=P3^1;

u16 count = 0;

//======函数声明==================
void t0_init();

void main(){
    t0_init();
    while(1){
       SEG7_mpx8_display_int(count+TH0*256+TL0);
			//P2 = TL0;
    }
}                                                


void t0_init() 
{
    TMOD = 0x05 ;            //t0 计数 工作方式1
    ET0  = 1;                //允许ET0中断
    EA   = 1;                //打开总中断
    TR0  = 1;                //启动定时器0    
}



void t0_isr(void) interrupt 1
{
    count += 65536;
}



//+---------------------------------------------------------------+
//|                          TMOD (89H)                           |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//| Bit 7 | Bit 6 | Bit 5 | Bit 4 | Bit 3 | Bit 2 | Bit 1 | Bit 0 |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//| GATE  | C/T#  |  M1   |  M0   | GATE  | C/T#  |  M1   |  M0   |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//|          Timer 1 控制区       |          Timer 0 控制区       |
//+---------------------------------------------------------------+

//功能说明：
//GATE  ：门控位，1 时由 INTx 与 TRx 共同启动
//C/T#    ：0 = 定时，1 = 计数
//M1/M0    ：工作模式选择 (00~11)


//+---------------------------------------------------------------+
//|                          TCON (88H)                           |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//| Bit 7 | Bit 6 | Bit 5 | Bit 4 | Bit 3 | Bit 2 | Bit 1 | Bit 0 |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//|  TF1  |  TR1  |  TF0  |  TR0  |  IE1  |  IT1  |  IE0  |  IT0  |
//+-------+-------+-------+-------+-------+-------+-------+-------+
//|     Timer 1   |    Timer 0    |    外部中断 1 |  外部中断 0   |
//+---------------------------------------------------------------+

//功能说明：
//TF1  : Timer1 溢出标志
//TR1  : Timer1 运行控制
//TF0  : Timer0 溢出标志
//TR0  : Timer0 运行控制
//IE1  : 外部中断1标志
//IT1  : 外部中断1触发方式
//IE0  : 外部中断0标志
//IT0  : 外部中断0触发方式
